Repository: furkandetseli/flutter_sudokugo
Catalog: lib/l10n/app_*.arb
Languages: fr, tr

source: Start
fr: Commencer
tr: Başla

# continueGame
source: Continue
fr: Reprendre
tr: Devam Et

source: New Game
fr: Nouveau Jeu
tr: Yeni Oyun

source: About
fr: À Propos
tr: Hakkımızda

# contact
source: İletişim
fr: Contact

source: Undo
fr: Annuler
tr: Geri Al

# errorCount
source: Error: {count}/3
fr: Erreur: {count}/3
tr: Hata: {count}/3

source: Hint: {count}
fr: Indice: {count}
tr: İpucu: {count}

source: Game Over
fr: Jeu Terminé
tr: Oyun Bitti

# gameOverMessage
source: You made 3 errors. A new game will start.
fr: Vous avez fait 3 erreurs. Un nouveau jeu va commencer.
tr: 3 hata yaptınız. Yeni bir oyun başlatılacak.

# highScoreLabel
source: High Score: {score}
fr: Meilleur Score: {score}
tr: En Yüksek Skor: {score}

source: Congratulations!
fr: Félicitations!
tr: Tebrikler!

# gameCompletedMessage
source: You have successfully completed the Sudoku puzzle!
fr: Vous avez réussi à compléter le puzzle Sudoku!
tr: Sudoku bulmacasını başarıyla tamamladınız!

# yourScore
source: Your score: {score}
fr: Votre score: {score}
tr: Skorunuz: {score}

source: Play Again
fr: Rejouer
tr: Tekrar Oyna

source: Watch Ad
fr: Regarder une Pub
tr: Reklam İzle

source: Restart
fr: Redémarrer
tr: Yeniden Başla

# scoreLabel
source: Score: {currentScore}
fr: Score: {currentScore} Meilleur: {highScore}
tr: Puan: {currentScore}

source: Statistics
fr: Statistiques
tr: İstatistikler

source: Games Played
fr: Jeux Joués
tr: Oynanan Oyunlar

source: Games Won
fr: Jeux Gagnés
tr: Kazanılan Oyunlar

source: Games Lost
fr: Jeux Perdus
tr: Kaybedilen Oyunlar

source: Best Time
fr: Meilleur Temps
tr: En İyi Süre

source: Total Hints Used
fr: Total d'Indices Utilisés
tr: Toplam Kullanılan İpuçları

source: Total Correct Moves
fr: Total de Mouvements Corrects
tr: Toplam Doğru Hamleler

source: Total Mistakes
fr: Total d'Erreurs
tr: Toplam Hatalar

source: How to Play
fr: Comment Jouer
tr: Nasıl Oynanır

source: Sudoku Rules:
fr: Règles de Sudoku:
tr: Sudoku Kuralları:

# rule1
source: 1. Fill in the grid so that every row, column, and 3x3 box contains the digits 1 through 9.
fr: 1. Remplissez la grille de manière à ce que chaque ligne, colonne et boîte de 3x3 contienne les chiffres de 1 à 9.
tr: 1. Izgara, her satır, sütun ve 3x3'lük kutuda 1'den 9'a kadar olan rakamları içerecek şekilde doldurulmalıdır.

# rule2
source: 2. Do not repeat any digits in a row, column, or 3x3 box.
fr: 2. Ne répétez aucun chiffre dans une ligne, une colonne ou une boîte de 3x3.
tr: 2. Bir satır, sütun veya 3x3'lük kutuda rakamları tekrarlamayın.

# rule3
source: 3. Use logic to deduce the correct placement of numbers.
fr: 3. Utilisez la logique pour déduire le placement correct des chiffres.
tr: 3. Sayıların doğru yerleşimini çıkarmak için mantık kullanın.

source: Tips:
fr: Conseils:
tr: İpuçları:

# tip1
source: • Start with the most filled rows, columns, or boxes.
fr: • Commencez par les lignes, colonnes ou boîtes les plus remplies.
tr: • En dolu satırlar, sütunlar veya kutularla başlayın.

# tip2
source: • Use the process of elimination to narrow down possibilities.
fr: • Utilisez le processus d'élimination pour réduire les possibilités.
tr: • Olasılıkları daraltmak için eleme yöntemini kullanın.

# tip3
source: • Don't guess! Sudoku is a game of logic and reasoning.
fr: • Ne devinez pas! Le Sudoku est un jeu de logique et de raisonnement.
tr: • Tahmin etmeyin! Sudoku bir mantık ve akıl yürütme oyunudur.

# name
source: Ad
fr: Nom

# email
source: E-posta
fr: E-mail

# message
source: Mesaj
fr: Message

# submit
source: Gönder
fr: Soumettre

# nameRequired
source: Lütfen adınızı girin
fr: Veuillez entrer votre nom

# emailRequired
source: Lütfen e-posta adresinizi girin
fr: Veuillez entrer votre adresse e-mail

# invalidEmail
source: Geçerli bir e-posta adresi girin
fr: Veuillez entrer une adresse e-mail valide

# messageRequired
source: Lütfen bir mesaj girin
fr: Veuillez entrer un message

source: OK
tr: Tamam

source: Time
tr: Zaman
